MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2GM6HHAGV20000/mcu.h
/******************************************************************************
 ** ADC Registers ADC2
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_ADC2_ADSR                              *((volatile  uint8_t*)(0x40027200UL))
#define FM4_ADC2_ADSR                             *((volatile  uint8_t*)(0x40027200UL))
#define FM_ADC2_ADCR                              *((volatile  uint8_t*)(0x40027201UL))
#define FM4_ADC2_ADCR                             *((volatile  uint8_t*)(0x40027201UL))
#define FM_ADC2_SFNS                              *((volatile  uint8_t*)(0x40027208UL))
#define FM4_ADC2_SFNS                             *((volatile  uint8_t*)(0x40027208UL))
#define FM_ADC2_SCCR                              *((volatile  uint8_t*)(0x40027209UL))
#define FM4_ADC2_SCCR                             *((volatile  uint8_t*)(0x40027209UL))
#define FM_ADC2_SCFD                              *((volatile uint32_t*)(0x4002720CUL))
#define FM4_ADC2_SCFD                             *((volatile uint32_t*)(0x4002720CUL))
#define FM_ADC2_SCFD_FDAS1                        *((volatile uint32_t*)(0x4002720CUL))
#define FM4_ADC2_SCFD_FDAS1                       *((volatile uint32_t*)(0x4002720CUL))
#define FM_ADC2_SCIS23                            *((volatile uint16_t*)(0x40027210UL))
#define FM4_ADC2_SCIS23                           *((volatile uint16_t*)(0x40027210UL))
#define FM_ADC2_SCIS01                            *((volatile uint16_t*)(0x40027214UL))
#define FM4_ADC2_SCIS01                           *((volatile uint16_t*)(0x40027214UL))
#define FM_ADC2_PFNS                              *((volatile  uint8_t*)(0x40027218UL))
#define FM4_ADC2_PFNS                             *((volatile  uint8_t*)(0x40027218UL))
#define FM_ADC2_PCCR                              *((volatile  uint8_t*)(0x40027219UL))
#define FM4_ADC2_PCCR                             *((volatile  uint8_t*)(0x40027219UL))
#define FM_ADC2_PCFD                              *((volatile uint32_t*)(0x4002721CUL))
#define FM4_ADC2_PCFD                             *((volatile uint32_t*)(0x4002721CUL))
#define FM_ADC2_PCFD_FDAS1                        *((volatile uint32_t*)(0x4002721CUL))
#define FM4_ADC2_PCFD_FDAS1                       *((volatile uint32_t*)(0x4002721CUL))
#define FM_ADC2_PCIS                              *((volatile  uint8_t*)(0x40027220UL))
#define FM4_ADC2_PCIS                             *((volatile  uint8_t*)(0x40027220UL))
#define FM_ADC2_CMPCR                             *((volatile  uint8_t*)(0x40027224UL))
#define FM4_ADC2_CMPCR                            *((volatile  uint8_t*)(0x40027224UL))
#define FM_ADC2_CMPD                              *((volatile uint16_t*)(0x40027226UL))
#define FM4_ADC2_CMPD                             *((volatile uint16_t*)(0x40027226UL))
#define FM_ADC2_ADSS23                            *((volatile uint16_t*)(0x40027228UL))
#define FM4_ADC2_ADSS23                           *((volatile uint16_t*)(0x40027228UL))
#define FM_ADC2_ADSS01                            *((volatile uint16_t*)(0x4002722CUL))
#define FM4_ADC2_ADSS01                           *((volatile uint16_t*)(0x4002722CUL))
#define FM_ADC2_ADST01                            *((volatile uint16_t*)(0x40027230UL))
#define FM4_ADC2_ADST01                           *((volatile uint16_t*)(0x40027230UL))
#define FM_ADC2_ADCT                              *((volatile  uint8_t*)(0x40027234UL))
#define FM4_ADC2_ADCT                             *((volatile  uint8_t*)(0x40027234UL))
#define FM_ADC2_PRTSL                             *((volatile  uint8_t*)(0x40027238UL))
#define FM4_ADC2_PRTSL                            *((volatile  uint8_t*)(0x40027238UL))
#define FM_ADC2_SCTSL                             *((volatile  uint8_t*)(0x40027239UL))
#define FM4_ADC2_SCTSL                            *((volatile  uint8_t*)(0x40027239UL))
#define FM_ADC2_ADCEN                             *((volatile uint16_t*)(0x4002723CUL))
#define FM4_ADC2_ADCEN                            *((volatile uint16_t*)(0x4002723CUL))
#define FM_ADC2_CALSR                             *((volatile uint32_t*)(0x40027240UL))
#define FM4_ADC2_CALSR                            *((volatile uint32_t*)(0x40027240UL))
#define FM_ADC2_WCMRCOT                           *((volatile  uint8_t*)(0x40027244UL))
#define FM4_ADC2_WCMRCOT                          *((volatile  uint8_t*)(0x40027244UL))
#define FM_ADC2_WCMRCIF                           *((volatile  uint8_t*)(0x40027248UL))
#define FM4_ADC2_WCMRCIF                          *((volatile  uint8_t*)(0x40027248UL))
#define FM_ADC2_WCMPCR                            *((volatile  uint8_t*)(0x4002724CUL))
#define FM4_ADC2_WCMPCR                           *((volatile  uint8_t*)(0x4002724CUL))
#define FM_ADC2_WCMPSR                            *((volatile  uint8_t*)(0x4002724DUL))
#define FM4_ADC2_WCMPSR                           *((volatile  uint8_t*)(0x4002724DUL))
#define FM_ADC2_WCMPDL                            *((volatile uint16_t*)(0x40027250UL))
#define FM4_ADC2_WCMPDL                           *((volatile uint16_t*)(0x40027250UL))
#define FM_ADC2_WCMPDH                            *((volatile uint16_t*)(0x40027252UL))
#define FM4_ADC2_WCMPDH                           *((volatile uint16_t*)(0x40027252UL))

/******************************************************************************
 ** BT Registers BT0
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_BT0_PPG_PRLL                           *((volatile uint16_t*)(0x40025000UL))
#define FM4_BT0_PPG_PRLL                          *((volatile uint16_t*)(0x40025000UL))
#define FM_BT0_PWM_PCSR                           *((volatile uint16_t*)(0x40025000UL))
#define FM4_BT0_PWM_PCSR                          *((volatile uint16_t*)(0x40025000UL))
#define FM_BT0_RT_PCSR                            *((volatile uint16_t*)(0x40025000UL))
#define FM4_BT0_RT_PCSR                           *((volatile uint16_t*)(0x40025000UL))
#define FM_BT0_PPG_PRLH                           *((volatile uint16_t*)(0x40025004UL))
#define FM4_BT0_PPG_PRLH                          *((volatile uint16_t*)(0x40025004UL))
#define FM_BT0_PWC_DTBF                           *((volatile uint16_t*)(0x40025004UL))
#define FM4_BT0_PWC_DTBF                          *((volatile uint16_t*)(0x40025004UL))
#define FM_BT0_PWM_PDUT                           *((volatile uint16_t*)(0x40025004UL))
#define FM4_BT0_PWM_PDUT                          *((volatile uint16_t*)(0x40025004UL))
#define FM_BT0_PPG_TMR                            *((volatile uint16_t*)(0x40025008UL))
#define FM4_BT0_PPG_TMR                           *((volatile uint16_t*)(0x40025008UL))
#define FM_BT0_PWM_TMR                            *((volatile uint16_t*)(0x40025008UL))
#define FM4_BT0_PWM_TMR                           *((volatile uint16_t*)(0x40025008UL))
#define FM_BT0_RT_TMR                             *((volatile uint16_t*)(0x40025008UL))
#define FM4_BT0_RT_TMR                            *((volatile uint16_t*)(0x40025008UL))
#define FM_BT0_PPG_TMCR                           *((volatile uint16_t*)(0x4002500CUL))
#define FM4_BT0_PPG_TMCR                          *((volatile uint16_t*)(0x4002500CUL))
#define FM_BT0_PWC_TMCR                           *((volatile uint16_t*)(0x4002500CUL))
#define FM4_BT0_PWC_TMCR                          *((volatile uint16_t*)(0x4002500CUL))
#define FM_BT0_PWM_TMCR                           *((volatile uint16_t*)(0x4002500CUL))
#define FM4_BT0_PWM_TMCR                          *((volatile uint16_t*)(0x4002500CUL))
#define FM_BT0_RT_TMCR                            *((volatile uint16_t*)(0x4002500CUL))
#define FM4_BT0_RT_TMCR                           *((volatile uint16_t*)(0x4002500CUL))
#define FM_BT0_PPG_STC                            *((volatile  uint8_t*)(0x40025010UL))
#define FM4_BT0_PPG_STC                           *((volatile  uint8_t*)(0x40025010UL))
#define FM_BT0_PWC_STC                            *((volatile  uint8_t*)(0x40025010UL))
#define FM4_BT0_PWC_STC                           *((volatile  uint8_t*)(0x40025010UL))
#define FM_BT0_PWM_STC                            *((volatile  uint8_t*)(0x40025010UL))
#define FM4_BT0_PWM_STC                           *((volatile  uint8_t*)(0x40025010UL))
#define FM_BT0_RT_STC                             *((volatile  uint8_t*)(0x40025010UL))
#define FM4_BT0_RT_STC                            *((volatile  uint8_t*)(0x40025010UL))
#define FM_BT0_PPG_TMCR2                          *((volatile  uint8_t*)(0x40025011UL))
#define FM4_BT0_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025011UL))
#define FM_BT0_PWC_TMCR2                          *((volatile  uint8_t*)(0x40025011UL))
#define FM4_BT0_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025011UL))
#define FM_BT0_PWM_TMCR2                          *((volatile  uint8_t*)(0x40025011UL))
#define FM4_BT0_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025011UL))
#define FM_BT0_RT_TMCR2                           *((volatile  uint8_t*)(0x40025011UL))
#define FM4_BT0_RT_TMCR2                          *((volatile  uint8_t*)(0x40025011UL))

