MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2GM6HHAGV20000/mcu.h
/******************************************************************************
 ** DT Registers DT
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_DT_TIMER1LOAD                          *((volatile uint32_t*)(0x40015000UL))
#define FM4_DT_TIMER1LOAD                         *((volatile uint32_t*)(0x40015000UL))
#define FM_DT_TIMER1VALUE                         *((volatile uint32_t*)(0x40015004UL))
#define FM4_DT_TIMER1VALUE                        *((volatile uint32_t*)(0x40015004UL))
#define FM_DT_TIMER1CONTROL                       *((volatile uint32_t*)(0x40015008UL))
#define FM4_DT_TIMER1CONTROL                      *((volatile uint32_t*)(0x40015008UL))
#define FM_DT_TIMER1INTCLR                        *((volatile uint32_t*)(0x4001500CUL))
#define FM4_DT_TIMER1INTCLR                       *((volatile uint32_t*)(0x4001500CUL))
#define FM_DT_TIMER1RIS                           *((volatile uint32_t*)(0x40015010UL))
#define FM4_DT_TIMER1RIS                          *((volatile uint32_t*)(0x40015010UL))
#define FM_DT_TIMER1MIS                           *((volatile uint32_t*)(0x40015014UL))
#define FM4_DT_TIMER1MIS                          *((volatile uint32_t*)(0x40015014UL))
#define FM_DT_TIMER1BGLOAD                        *((volatile uint32_t*)(0x40015018UL))
#define FM4_DT_TIMER1BGLOAD                       *((volatile uint32_t*)(0x40015018UL))
#define FM_DT_TIMER2LOAD                          *((volatile uint32_t*)(0x40015020UL))
#define FM4_DT_TIMER2LOAD                         *((volatile uint32_t*)(0x40015020UL))
#define FM_DT_TIMER2VALUE                         *((volatile uint32_t*)(0x40015024UL))
#define FM4_DT_TIMER2VALUE                        *((volatile uint32_t*)(0x40015024UL))
#define FM_DT_TIMER2CONTROL                       *((volatile uint32_t*)(0x40015028UL))
#define FM4_DT_TIMER2CONTROL                      *((volatile uint32_t*)(0x40015028UL))
#define FM_DT_TIMER2INTCLR                        *((volatile uint32_t*)(0x4001502CUL))
#define FM4_DT_TIMER2INTCLR                       *((volatile uint32_t*)(0x4001502CUL))
#define FM_DT_TIMER2RIS                           *((volatile uint32_t*)(0x40015030UL))
#define FM4_DT_TIMER2RIS                          *((volatile uint32_t*)(0x40015030UL))
#define FM_DT_TIMER2MIS                           *((volatile uint32_t*)(0x40015034UL))
#define FM4_DT_TIMER2MIS                          *((volatile uint32_t*)(0x40015034UL))
#define FM_DT_TIMER2BGLOAD                        *((volatile uint32_t*)(0x40015038UL))
#define FM4_DT_TIMER2BGLOAD                       *((volatile uint32_t*)(0x40015038UL))

/******************************************************************************
 ** ECC_CAPTURE Registers ECC_CAPTURE
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_ECC_CAPTURE_FERRAD                     *((volatile uint32_t*)(0x40000300UL))
#define FM4_ECC_CAPTURE_FERRAD                    *((volatile uint32_t*)(0x40000300UL))

/******************************************************************************
 ** ETHERNET_CONTROL Registers ETHERNET_CONTROL
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_ETHERNET_CONTROL_ETH_MODE              *((volatile uint32_t*)(0x40066000UL))
#define FM4_ETHERNET_CONTROL_ETH_MODE             *((volatile uint32_t*)(0x40066000UL))
#define FM_ETHERNET_CONTROL_ETH_CLKG              *((volatile uint32_t*)(0x40066008UL))
#define FM4_ETHERNET_CONTROL_ETH_CLKG             *((volatile uint32_t*)(0x40066008UL))

/******************************************************************************
 ** ETHERNET_MAC Registers ETHERNET_MAC0
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_ETHERNET_MAC0_MCR                      *((volatile uint32_t*)(0x40064000UL))
#define FM4_ETHERNET_MAC0_MCR                     *((volatile uint32_t*)(0x40064000UL))
#define FM_ETHERNET_MAC0_MFFR                     *((volatile uint32_t*)(0x40064004UL))
#define FM4_ETHERNET_MAC0_MFFR                    *((volatile uint32_t*)(0x40064004UL))
#define FM_ETHERNET_MAC0_MHTRH                    *((volatile uint32_t*)(0x40064008UL))
#define FM4_ETHERNET_MAC0_MHTRH                   *((volatile uint32_t*)(0x40064008UL))
#define FM_ETHERNET_MAC0_MHTRL                    *((volatile uint32_t*)(0x4006400CUL))
#define FM4_ETHERNET_MAC0_MHTRL                   *((volatile uint32_t*)(0x4006400CUL))
#define FM_ETHERNET_MAC0_GAR                      *((volatile uint32_t*)(0x40064010UL))
#define FM4_ETHERNET_MAC0_GAR                     *((volatile uint32_t*)(0x40064010UL))
#define FM_ETHERNET_MAC0_GDR                      *((volatile uint32_t*)(0x40064014UL))
#define FM4_ETHERNET_MAC0_GDR                     *((volatile uint32_t*)(0x40064014UL))
#define FM_ETHERNET_MAC0_FCR                      *((volatile uint32_t*)(0x40064018UL))
#define FM4_ETHERNET_MAC0_FCR                     *((volatile uint32_t*)(0x40064018UL))
#define FM_ETHERNET_MAC0_VTR                      *((volatile uint32_t*)(0x4006401CUL))
#define FM4_ETHERNET_MAC0_VTR                     *((volatile uint32_t*)(0x4006401CUL))
#define FM_ETHERNET_MAC0_RWFFR                    *((volatile uint32_t*)(0x40064028UL))
#define FM4_ETHERNET_MAC0_RWFFR                   *((volatile uint32_t*)(0x40064028UL))
#define FM_ETHERNET_MAC0_PMTR                     *((volatile uint32_t*)(0x4006402CUL))
#define FM4_ETHERNET_MAC0_PMTR                    *((volatile uint32_t*)(0x4006402CUL))
#define FM_ETHERNET_MAC0_LPICSR                   *((volatile uint32_t*)(0x40064030UL))
#define FM4_ETHERNET_MAC0_LPICSR                  *((volatile uint32_t*)(0x40064030UL))
#define FM_ETHERNET_MAC0_LPITCR                   *((volatile uint32_t*)(0x40064034UL))
#define FM4_ETHERNET_MAC0_LPITCR                  *((volatile uint32_t*)(0x40064034UL))
#define FM_ETHERNET_MAC0_ISR                      *((volatile uint32_t*)(0x40064038UL))
#define FM4_ETHERNET_MAC0_ISR                     *((volatile uint32_t*)(0x40064038UL))
#define FM_ETHERNET_MAC0_IMR                      *((volatile uint32_t*)(0x4006403CUL))
#define FM4_ETHERNET_MAC0_IMR                     *((volatile uint32_t*)(0x4006403CUL))
#define FM_ETHERNET_MAC0_MAR0H                    *((volatile uint32_t*)(0x40064040UL))
#define FM4_ETHERNET_MAC0_MAR0H                   *((volatile uint32_t*)(0x40064040UL))
#define FM_ETHERNET_MAC0_MAR0L                    *((volatile uint32_t*)(0x40064044UL))
#define FM4_ETHERNET_MAC0_MAR0L                   *((volatile uint32_t*)(0x40064044UL))
#define FM_ETHERNET_MAC0_MAR1H                    *((volatile uint32_t*)(0x40064048UL))
#define FM4_ETHERNET_MAC0_MAR1H                   *((volatile uint32_t*)(0x40064048UL))
#define FM_ETHERNET_MAC0_MAR1L                    *((volatile uint32_t*)(0x4006404CUL))
#define FM4_ETHERNET_MAC0_MAR1L                   *((volatile uint32_t*)(0x4006404CUL))
#define FM_ETHERNET_MAC0_MAR2H                    *((volatile uint32_t*)(0x40064050UL))
#define FM4_ETHERNET_MAC0_MAR2H                   *((volatile uint32_t*)(0x40064050UL))
#define FM_ETHERNET_MAC0_MAR2L                    *((volatile uint32_t*)(0x40064054UL))
#define FM4_ETHERNET_MAC0_MAR2L                   *((volatile uint32_t*)(0x40064054UL))
#define FM_ETHERNET_MAC0_MAR3H                    *((volatile uint32_t*)(0x40064058UL))
#define FM4_ETHERNET_MAC0_MAR3H                   *((volatile uint32_t*)(0x40064058UL))
#define FM_ETHERNET_MAC0_MAR3L                    *((volatile uint32_t*)(0x4006405CUL))
#define FM4_ETHERNET_MAC0_MAR3L                   *((volatile uint32_t*)(0x4006405CUL))
#define FM_ETHERNET_MAC0_MAR4H                    *((volatile uint32_t*)(0x40064060UL))
#define FM4_ETHERNET_MAC0_MAR4H                   *((volatile uint32_t*)(0x40064060UL))
#define FM_ETHERNET_MAC0_MAR4L                    *((volatile uint32_t*)(0x40064064UL))
#define FM4_ETHERNET_MAC0_MAR4L                   *((volatile uint32_t*)(0x40064064UL))
#define FM_ETHERNET_MAC0_MAR5H                    *((volatile uint32_t*)(0x40064068UL))
#define FM4_ETHERNET_MAC0_MAR5H                   *((volatile uint32_t*)(0x40064068UL))
#define FM_ETHERNET_MAC0_MAR5L                    *((volatile uint32_t*)(0x4006406CUL))
#define FM4_ETHERNET_MAC0_MAR5L                   *((volatile uint32_t*)(0x4006406CUL))
#define FM_ETHERNET_MAC0_MAR6H                    *((volatile uint32_t*)(0x40064070UL))
#define FM4_ETHERNET_MAC0_MAR6H                   *((volatile uint32_t*)(0x40064070UL))
#define FM_ETHERNET_MAC0_MAR6L                    *((volatile uint32_t*)(0x40064074UL))
#define FM4_ETHERNET_MAC0_MAR6L                   *((volatile uint32_t*)(0x40064074UL))
#define FM_ETHERNET_MAC0_MAR7H                    *((volatile uint32_t*)(0x40064078UL))
#define FM4_ETHERNET_MAC0_MAR7H                   *((volatile uint32_t*)(0x40064078UL))
#define FM_ETHERNET_MAC0_MAR7L                    *((volatile uint32_t*)(0x4006407CUL))
#define FM4_ETHERNET_MAC0_MAR7L                   *((volatile uint32_t*)(0x4006407CUL))
#define FM_ETHERNET_MAC0_MAR8H                    *((volatile uint32_t*)(0x40064080UL))
#define FM4_ETHERNET_MAC0_MAR8H                   *((volatile uint32_t*)(0x40064080UL))
#define FM_ETHERNET_MAC0_MAR8L                    *((volatile uint32_t*)(0x40064084UL))
#define FM4_ETHERNET_MAC0_MAR8L                   *((volatile uint32_t*)(0x40064084UL))
#define FM_ETHERNET_MAC0_MAR9H                    *((volatile uint32_t*)(0x40064088UL))
#define FM4_ETHERNET_MAC0_MAR9H                   *((volatile uint32_t*)(0x40064088UL))
#define FM_ETHERNET_MAC0_MAR9L                    *((volatile uint32_t*)(0x4006408CUL))
#define FM4_ETHERNET_MAC0_MAR9L                   *((volatile uint32_t*)(0x4006408CUL))
#define FM_ETHERNET_MAC0_MAR10H                   *((volatile uint32_t*)(0x40064090UL))
#define FM4_ETHERNET_MAC0_MAR10H                  *((volatile uint32_t*)(0x40064090UL))
#define FM_ETHERNET_MAC0_MAR10L                   *((volatile uint32_t*)(0x40064094UL))
#define FM4_ETHERNET_MAC0_MAR10L                  *((volatile uint32_t*)(0x40064094UL))
#define FM_ETHERNET_MAC0_MAR11H                   *((volatile uint32_t*)(0x40064098UL))
#define FM4_ETHERNET_MAC0_MAR11H                  *((volatile uint32_t*)(0x40064098UL))
#define FM_ETHERNET_MAC0_MAR11L                   *((volatile uint32_t*)(0x4006409CUL))
#define FM4_ETHERNET_MAC0_MAR11L                  *((volatile uint32_t*)(0x4006409CUL))
#define FM_ETHERNET_MAC0_MAR12H                   *((volatile uint32_t*)(0x400640A0UL))
#define FM4_ETHERNET_MAC0_MAR12H                  *((volatile uint32_t*)(0x400640A0UL))
#define FM_ETHERNET_MAC0_MAR12L                   *((volatile uint32_t*)(0x400640A4UL))
#define FM4_ETHERNET_MAC0_MAR12L                  *((volatile uint32_t*)(0x400640A4UL))
#define FM_ETHERNET_MAC0_MAR13H                   *((volatile uint32_t*)(0x400640A8UL))
#define FM4_ETHERNET_MAC0_MAR13H                  *((volatile uint32_t*)(0x400640A8UL))
#define FM_ETHERNET_MAC0_MAR13L                   *((volatile uint32_t*)(0x400640ACUL))
#define FM4_ETHERNET_MAC0_MAR13L                  *((volatile uint32_t*)(0x400640ACUL))
#define FM_ETHERNET_MAC0_MAR14H                   *((volatile uint32_t*)(0x400640B0UL))
#define FM4_ETHERNET_MAC0_MAR14H                  *((volatile uint32_t*)(0x400640B0UL))
#define FM_ETHERNET_MAC0_MAR14L                   *((volatile uint32_t*)(0x400640B4UL))
#define FM4_ETHERNET_MAC0_MAR14L                  *((volatile uint32_t*)(0x400640B4UL))
#define FM_ETHERNET_MAC0_MAR15H                   *((volatile uint32_t*)(0x400640B8UL))
#define FM4_ETHERNET_MAC0_MAR15H                  *((volatile uint32_t*)(0x400640B8UL))
#define FM_ETHERNET_MAC0_MAR15L                   *((volatile uint32_t*)(0x400640BCUL))
#define FM4_ETHERNET_MAC0_MAR15L                  *((volatile uint32_t*)(0x400640BCUL))
#define FM_ETHERNET_MAC0_RGSR                     *((volatile uint32_t*)(0x400640D8UL))
#define FM4_ETHERNET_MAC0_RGSR                    *((volatile uint32_t*)(0x400640D8UL))
#define FM_ETHERNET_MAC0_MMC_CNTL                 *((volatile uint32_t*)(0x40064100UL))
#define FM4_ETHERNET_MAC0_MMC_CNTL                *((volatile uint32_t*)(0x40064100UL))
#define FM_ETHERNET_MAC0_MMC_INTR_RX              *((volatile uint32_t*)(0x40064104UL))
#define FM4_ETHERNET_MAC0_MMC_INTR_RX             *((volatile uint32_t*)(0x40064104UL))
#define FM_ETHERNET_MAC0_MMC_INTR_TX              *((volatile uint32_t*)(0x40064108UL))
#define FM4_ETHERNET_MAC0_MMC_INTR_TX             *((volatile uint32_t*)(0x40064108UL))
#define FM_ETHERNET_MAC0_MMC_INTR_MASK_RX         *((volatile uint32_t*)(0x4006410CUL))
#define FM4_ETHERNET_MAC0_MMC_INTR_MASK_RX        *((volatile uint32_t*)(0x4006410CUL))
#define FM_ETHERNET_MAC0_MMC_INTR_MASK_TX         *((volatile uint32_t*)(0x40064110UL))
#define FM4_ETHERNET_MAC0_MMC_INTR_MASK_TX        *((volatile uint32_t*)(0x40064110UL))
#define FM_ETHERNET_MAC0_TXOCTETCOUNT_GB          *((volatile uint32_t*)(0x40064114UL))
#define FM4_ETHERNET_MAC0_TXOCTETCOUNT_GB         *((volatile uint32_t*)(0x40064114UL))
#define FM_ETHERNET_MAC0_TXFRAMECOUNT_GB          *((volatile uint32_t*)(0x40064118UL))
#define FM4_ETHERNET_MAC0_TXFRAMECOUNT_GB         *((volatile uint32_t*)(0x40064118UL))
#define FM_ETHERNET_MAC0_TXBROADCASTFRAMES_G      *((volatile uint32_t*)(0x4006411CUL))
#define FM4_ETHERNET_MAC0_TXBROADCASTFRAMES_G     *((volatile uint32_t*)(0x4006411CUL))
#define FM_ETHERNET_MAC0_TXMULTICASTFRAMES_G      *((volatile uint32_t*)(0x40064120UL))
#define FM4_ETHERNET_MAC0_TXMULTICASTFRAMES_G     *((volatile uint32_t*)(0x40064120UL))
#define FM_ETHERNET_MAC0_TX64OCTETS_GB            *((volatile uint32_t*)(0x40064124UL))
#define FM4_ETHERNET_MAC0_TX64OCTETS_GB           *((volatile uint32_t*)(0x40064124UL))
#define FM_ETHERNET_MAC0_TX65TO127OCTETS_GB       *((volatile uint32_t*)(0x40064128UL))
#define FM4_ETHERNET_MAC0_TX65TO127OCTETS_GB      *((volatile uint32_t*)(0x40064128UL))
#define FM_ETHERNET_MAC0_TX128TO255OCTETS_GB      *((volatile uint32_t*)(0x4006412CUL))
#define FM4_ETHERNET_MAC0_TX128TO255OCTETS_GB     *((volatile uint32_t*)(0x4006412CUL))
#define FM_ETHERNET_MAC0_TX256TO511OCTETS_GB      *((volatile uint32_t*)(0x40064130UL))
#define FM4_ETHERNET_MAC0_TX256TO511OCTETS_GB     *((volatile uint32_t*)(0x40064130UL))
#define FM_ETHERNET_MAC0_TX512TO1023OCTETS_GB     *((volatile uint32_t*)(0x40064134UL))
#define FM4_ETHERNET_MAC0_TX512TO1023OCTETS_GB    *((volatile uint32_t*)(0x40064134UL))
#define FM_ETHERNET_MAC0_TX1024TOMAXOCTETS_GB     *((volatile uint32_t*)(0x40064138UL))
#define FM4_ETHERNET_MAC0_TX1024TOMAXOCTETS_GB    *((volatile uint32_t*)(0x40064138UL))
#define FM_ETHERNET_MAC0_TXUNICASTFRAMES_GB       *((volatile uint32_t*)(0x4006413CUL))
#define FM4_ETHERNET_MAC0_TXUNICASTFRAMES_GB      *((volatile uint32_t*)(0x4006413CUL))
#define FM_ETHERNET_MAC0_TXMULTICASTFRAMES_GB     *((volatile uint32_t*)(0x40064140UL))
#define FM4_ETHERNET_MAC0_TXMULTICASTFRAMES_GB    *((volatile uint32_t*)(0x40064140UL))
#define FM_ETHERNET_MAC0_TXBROADCASTFRAMES_GB     *((volatile uint32_t*)(0x40064144UL))
#define FM4_ETHERNET_MAC0_TXBROADCASTFRAMES_GB    *((volatile uint32_t*)(0x40064144UL))
#define FM_ETHERNET_MAC0_TXUNDERFLOWERROR         *((volatile uint32_t*)(0x40064148UL))
#define FM4_ETHERNET_MAC0_TXUNDERFLOWERROR        *((volatile uint32_t*)(0x40064148UL))
#define FM_ETHERNET_MAC0_TXSINGLECOL_G            *((volatile uint32_t*)(0x4006414CUL))
#define FM4_ETHERNET_MAC0_TXSINGLECOL_G           *((volatile uint32_t*)(0x4006414CUL))
#define FM_ETHERNET_MAC0_TXMULTICOL_G             *((volatile uint32_t*)(0x40064150UL))
#define FM4_ETHERNET_MAC0_TXMULTICOL_G            *((volatile uint32_t*)(0x40064150UL))
#define FM_ETHERNET_MAC0_TXDEFERRED               *((volatile uint32_t*)(0x40064154UL))
#define FM4_ETHERNET_MAC0_TXDEFERRED              *((volatile uint32_t*)(0x40064154UL))
#define FM_ETHERNET_MAC0_TXLATECOL                *((volatile uint32_t*)(0x40064158UL))
#define FM4_ETHERNET_MAC0_TXLATECOL               *((volatile uint32_t*)(0x40064158UL))
#define FM_ETHERNET_MAC0_TXEXESSCOL               *((volatile uint32_t*)(0x4006415CUL))
#define FM4_ETHERNET_MAC0_TXEXESSCOL              *((volatile uint32_t*)(0x4006415CUL))
#define FM_ETHERNET_MAC0_TXCARRIERERROR           *((volatile uint32_t*)(0x40064160UL))
#define FM4_ETHERNET_MAC0_TXCARRIERERROR          *((volatile uint32_t*)(0x40064160UL))
#define FM_ETHERNET_MAC0_TXOCTETCOUNT_G           *((volatile uint32_t*)(0x40064164UL))
#define FM4_ETHERNET_MAC0_TXOCTETCOUNT_G          *((volatile uint32_t*)(0x40064164UL))
#define FM_ETHERNET_MAC0_TXFRAMECOUNT_G           *((volatile uint32_t*)(0x40064168UL))
#define FM4_ETHERNET_MAC0_TXFRAMECOUNT_G          *((volatile uint32_t*)(0x40064168UL))
#define FM_ETHERNET_MAC0_TXEXECESSDEF_G           *((volatile uint32_t*)(0x4006416CUL))
#define FM4_ETHERNET_MAC0_TXEXECESSDEF_G          *((volatile uint32_t*)(0x4006416CUL))
#define FM_ETHERNET_MAC0_TXPAUSEFRAMES            *((volatile uint32_t*)(0x40064170UL))
#define FM4_ETHERNET_MAC0_TXPAUSEFRAMES           *((volatile uint32_t*)(0x40064170UL))
#define FM_ETHERNET_MAC0_TXVLANFRAMES_G           *((volatile uint32_t*)(0x40064174UL))
#define FM4_ETHERNET_MAC0_TXVLANFRAMES_G          *((volatile uint32_t*)(0x40064174UL))
#define FM_ETHERNET_MAC0_RXFRAMECOUNT_GB          *((volatile uint32_t*)(0x40064180UL))
#define FM4_ETHERNET_MAC0_RXFRAMECOUNT_GB         *((volatile uint32_t*)(0x40064180UL))
#define FM_ETHERNET_MAC0_RXOCTETCOUNT_GB          *((volatile uint32_t*)(0x40064184UL))
#define FM4_ETHERNET_MAC0_RXOCTETCOUNT_GB         *((volatile uint32_t*)(0x40064184UL))
#define FM_ETHERNET_MAC0_RXOCTETCOUNT_G           *((volatile uint32_t*)(0x40064188UL))
#define FM4_ETHERNET_MAC0_RXOCTETCOUNT_G          *((volatile uint32_t*)(0x40064188UL))
#define FM_ETHERNET_MAC0_RXBROADCASTFRAMES_G      *((volatile uint32_t*)(0x4006418CUL))
#define FM4_ETHERNET_MAC0_RXBROADCASTFRAMES_G     *((volatile uint32_t*)(0x4006418CUL))
#define FM_ETHERNET_MAC0_RXMULTICASTFRAMES_G      *((volatile uint32_t*)(0x40064190UL))
#define FM4_ETHERNET_MAC0_RXMULTICASTFRAMES_G     *((volatile uint32_t*)(0x40064190UL))
#define FM_ETHERNET_MAC0_RXCRCERROR               *((volatile uint32_t*)(0x40064194UL))
#define FM4_ETHERNET_MAC0_RXCRCERROR              *((volatile uint32_t*)(0x40064194UL))
#define FM_ETHERNET_MAC0_RXALLIGNMENTERROR        *((volatile uint32_t*)(0x40064198UL))
#define FM4_ETHERNET_MAC0_RXALLIGNMENTERROR       *((volatile uint32_t*)(0x40064198UL))
#define FM_ETHERNET_MAC0_RXRUNTERROR              *((volatile uint32_t*)(0x4006419CUL))
#define FM4_ETHERNET_MAC0_RXRUNTERROR             *((volatile uint32_t*)(0x4006419CUL))
#define FM_ETHERNET_MAC0_RXJABBERERROR            *((volatile uint32_t*)(0x400641A0UL))
#define FM4_ETHERNET_MAC0_RXJABBERERROR           *((volatile uint32_t*)(0x400641A0UL))
#define FM_ETHERNET_MAC0_RXUNDERSIZE_G            *((volatile uint32_t*)(0x400641A4UL))
#define FM4_ETHERNET_MAC0_RXUNDERSIZE_G           *((volatile uint32_t*)(0x400641A4UL))
#define FM_ETHERNET_MAC0_RXOVERSIZE_G             *((volatile uint32_t*)(0x400641A8UL))
#define FM4_ETHERNET_MAC0_RXOVERSIZE_G            *((volatile uint32_t*)(0x400641A8UL))
#define FM_ETHERNET_MAC0_RX64OCTETS_GB            *((volatile uint32_t*)(0x400641ACUL))
#define FM4_ETHERNET_MAC0_RX64OCTETS_GB           *((volatile uint32_t*)(0x400641ACUL))
#define FM_ETHERNET_MAC0_RX65TO127OCTETS_GB       *((volatile uint32_t*)(0x400641B0UL))
#define FM4_ETHERNET_MAC0_RX65TO127OCTETS_GB      *((volatile uint32_t*)(0x400641B0UL))
#define FM_ETHERNET_MAC0_RX128TO255OCTETS_GB      *((volatile uint32_t*)(0x400641B4UL))
#define FM4_ETHERNET_MAC0_RX128TO255OCTETS_GB     *((volatile uint32_t*)(0x400641B4UL))
#define FM_ETHERNET_MAC0_RX256TO511OCTETS_GB      *((volatile uint32_t*)(0x400641B8UL))
#define FM4_ETHERNET_MAC0_RX256TO511OCTETS_GB     *((volatile uint32_t*)(0x400641B8UL))
#define FM_ETHERNET_MAC0_RX512TO1023OCTETS_GB     *((volatile uint32_t*)(0x400641BCUL))
#define FM4_ETHERNET_MAC0_RX512TO1023OCTETS_GB    *((volatile uint32_t*)(0x400641BCUL))
#define FM_ETHERNET_MAC0_RX1024TOMAXOCTETS_GB     *((volatile uint32_t*)(0x400641C0UL))
#define FM4_ETHERNET_MAC0_RX1024TOMAXOCTETS_GB    *((volatile uint32_t*)(0x400641C0UL))
#define FM_ETHERNET_MAC0_RXUNICASTFRAMES_G        *((volatile uint32_t*)(0x400641C4UL))
#define FM4_ETHERNET_MAC0_RXUNICASTFRAMES_G       *((volatile uint32_t*)(0x400641C4UL))
#define FM_ETHERNET_MAC0_RXLENGTHERROR            *((volatile uint32_t*)(0x400641C8UL))
#define FM4_ETHERNET_MAC0_RXLENGTHERROR           *((volatile uint32_t*)(0x400641C8UL))
#define FM_ETHERNET_MAC0_RXOUTOFRANGETYPE         *((volatile uint32_t*)(0x400641CCUL))
#define FM4_ETHERNET_MAC0_RXOUTOFRANGETYPE        *((volatile uint32_t*)(0x400641CCUL))
#define FM_ETHERNET_MAC0_RXPAUSEFRAMES            *((volatile uint32_t*)(0x400641D0UL))
#define FM4_ETHERNET_MAC0_RXPAUSEFRAMES           *((volatile uint32_t*)(0x400641D0UL))
#define FM_ETHERNET_MAC0_RXFIFOOVERFLOW           *((volatile uint32_t*)(0x400641D4UL))
#define FM4_ETHERNET_MAC0_RXFIFOOVERFLOW          *((volatile uint32_t*)(0x400641D4UL))
#define FM_ETHERNET_MAC0_RXVLANFRAMES_GB          *((volatile uint32_t*)(0x400641D8UL))
#define FM4_ETHERNET_MAC0_RXVLANFRAMES_GB         *((volatile uint32_t*)(0x400641D8UL))
#define FM_ETHERNET_MAC0_RXWATCHDOGERROR          *((volatile uint32_t*)(0x400641DCUL))
#define FM4_ETHERNET_MAC0_RXWATCHDOGERROR         *((volatile uint32_t*)(0x400641DCUL))
#define FM_ETHERNET_MAC0_MMC_IPC_INTR_MASK_RX     *((volatile uint32_t*)(0x40064200UL))
#define FM4_ETHERNET_MAC0_MMC_IPC_INTR_MASK_RX    *((volatile uint32_t*)(0x40064200UL))
#define FM_ETHERNET_MAC0_MMC_IPC_INTR_RX          *((volatile uint32_t*)(0x40064208UL))
#define FM4_ETHERNET_MAC0_MMC_IPC_INTR_RX         *((volatile uint32_t*)(0x40064208UL))
#define FM_ETHERNET_MAC0_RXIPV4_GD_FRMS           *((volatile uint32_t*)(0x40064210UL))
#define FM4_ETHERNET_MAC0_RXIPV4_GD_FRMS          *((volatile uint32_t*)(0x40064210UL))
#define FM_ETHERNET_MAC0_RXIPV4_HDRERR_FRMS       *((volatile uint32_t*)(0x40064214UL))
#define FM4_ETHERNET_MAC0_RXIPV4_HDRERR_FRMS      *((volatile uint32_t*)(0x40064214UL))
#define FM_ETHERNET_MAC0_RXIPV4_NOPAY_FRMS        *((volatile uint32_t*)(0x40064218UL))
#define FM4_ETHERNET_MAC0_RXIPV4_NOPAY_FRMS       *((volatile uint32_t*)(0x40064218UL))
#define FM_ETHERNET_MAC0_RXIPV4_FRAG_FRMS         *((volatile uint32_t*)(0x4006421CUL))
#define FM4_ETHERNET_MAC0_RXIPV4_FRAG_FRMS        *((volatile uint32_t*)(0x4006421CUL))
#define FM_ETHERNET_MAC0_RXIPV4_UDSBL_FRMS        *((volatile uint32_t*)(0x40064220UL))
#define FM4_ETHERNET_MAC0_RXIPV4_UDSBL_FRMS       *((volatile uint32_t*)(0x40064220UL))
#define FM_ETHERNET_MAC0_RXIPV6_GD_FRMS           *((volatile uint32_t*)(0x40064224UL))
#define FM4_ETHERNET_MAC0_RXIPV6_GD_FRMS          *((volatile uint32_t*)(0x40064224UL))
#define FM_ETHERNET_MAC0_RXIPV6_HDRERR_FRMS       *((volatile uint32_t*)(0x40064228UL))
#define FM4_ETHERNET_MAC0_RXIPV6_HDRERR_FRMS      *((volatile uint32_t*)(0x40064228UL))
#define FM_ETHERNET_MAC0_RXIPV6_NOPAY_FRMS        *((volatile uint32_t*)(0x4006422CUL))
#define FM4_ETHERNET_MAC0_RXIPV6_NOPAY_FRMS       *((volatile uint32_t*)(0x4006422CUL))
#define FM_ETHERNET_MAC0_RXUDP_GD_FRMS            *((volatile uint32_t*)(0x40064230UL))
#define FM4_ETHERNET_MAC0_RXUDP_GD_FRMS           *((volatile uint32_t*)(0x40064230UL))
#define FM_ETHERNET_MAC0_RXUDP_ERR_FRMS           *((volatile uint32_t*)(0x40064234UL))
#define FM4_ETHERNET_MAC0_RXUDP_ERR_FRMS          *((volatile uint32_t*)(0x40064234UL))
#define FM_ETHERNET_MAC0_RXTCP_GD_FRMS            *((volatile uint32_t*)(0x40064238UL))
#define FM4_ETHERNET_MAC0_RXTCP_GD_FRMS           *((volatile uint32_t*)(0x40064238UL))
