MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2GM6HHAGV20000/mcu.h
/******************************************************************************
 ** QPRC_NF Registers QPRC2_NF
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_QPRC2_NF_NFCTLA                        *((volatile  uint8_t*)(0x40026120UL))
#define FM4_QPRC2_NF_NFCTLA                       *((volatile  uint8_t*)(0x40026120UL))
#define FM_QPRC2_NF_NFCTLB                        *((volatile  uint8_t*)(0x40026124UL))
#define FM4_QPRC2_NF_NFCTLB                       *((volatile  uint8_t*)(0x40026124UL))
#define FM_QPRC2_NF_NFCTLZ                        *((volatile  uint8_t*)(0x40026128UL))
#define FM4_QPRC2_NF_NFCTLZ                       *((volatile  uint8_t*)(0x40026128UL))

/******************************************************************************
 ** QPRC Registers QPRC3
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_QPRC3_QPCR                             *((volatile uint16_t*)(0x400260C0UL))
#define FM4_QPRC3_QPCR                            *((volatile uint16_t*)(0x400260C0UL))
#define FM_QPRC3_QRCR                             *((volatile uint16_t*)(0x400260C4UL))
#define FM4_QPRC3_QRCR                            *((volatile uint16_t*)(0x400260C4UL))
#define FM_QPRC3_QPCCR                            *((volatile uint16_t*)(0x400260C8UL))
#define FM4_QPRC3_QPCCR                           *((volatile uint16_t*)(0x400260C8UL))
#define FM_QPRC3_QPRCR                            *((volatile uint16_t*)(0x400260CCUL))
#define FM4_QPRC3_QPRCR                           *((volatile uint16_t*)(0x400260CCUL))
#define FM_QPRC3_QMPR                             *((volatile uint16_t*)(0x400260D0UL))
#define FM4_QPRC3_QMPR                            *((volatile uint16_t*)(0x400260D0UL))
#define FM_QPRC3_QICRL                            *((volatile  uint8_t*)(0x400260D4UL))
#define FM4_QPRC3_QICRL                           *((volatile  uint8_t*)(0x400260D4UL))
#define FM_QPRC3_QICRH                            *((volatile  uint8_t*)(0x400260D5UL))
#define FM4_QPRC3_QICRH                           *((volatile  uint8_t*)(0x400260D5UL))
#define FM_QPRC3_QCR                              *((volatile uint16_t*)(0x400260D8UL))
#define FM4_QPRC3_QCR                             *((volatile uint16_t*)(0x400260D8UL))
#define FM_QPRC3_QECR                             *((volatile uint16_t*)(0x400260DCUL))
#define FM4_QPRC3_QECR                            *((volatile uint16_t*)(0x400260DCUL))
#define FM_QPRC3_QPRCRR                           *((volatile uint32_t*)(0x400260FCUL))
#define FM4_QPRC3_QPRCRR                          *((volatile uint32_t*)(0x400260FCUL))

/******************************************************************************
 ** QPRC_NF Registers QPRC3_NF
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_QPRC3_NF_NFCTLA                        *((volatile  uint8_t*)(0x40026130UL))
#define FM4_QPRC3_NF_NFCTLA                       *((volatile  uint8_t*)(0x40026130UL))
#define FM_QPRC3_NF_NFCTLB                        *((volatile  uint8_t*)(0x40026134UL))
#define FM4_QPRC3_NF_NFCTLB                       *((volatile  uint8_t*)(0x40026134UL))
#define FM_QPRC3_NF_NFCTLZ                        *((volatile  uint8_t*)(0x40026138UL))
#define FM4_QPRC3_NF_NFCTLZ                       *((volatile  uint8_t*)(0x40026138UL))

/******************************************************************************
 ** RTC Registers RTC
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_RTC_WTCR1                              *((volatile uint32_t*)(0x4003B000UL))
#define FM4_RTC_WTCR1                             *((volatile uint32_t*)(0x4003B000UL))
#define FM_RTC_WTCR2                              *((volatile uint32_t*)(0x4003B004UL))
#define FM4_RTC_WTCR2                             *((volatile uint32_t*)(0x4003B004UL))
#define FM_RTC_WTBR                               *((volatile uint32_t*)(0x4003B008UL))
#define FM4_RTC_WTBR                              *((volatile uint32_t*)(0x4003B008UL))
#define FM_RTC_WTSR                               *((volatile  uint8_t*)(0x4003B00CUL))
#define FM4_RTC_WTSR                              *((volatile  uint8_t*)(0x4003B00CUL))
#define FM_RTC_WTMIR                              *((volatile  uint8_t*)(0x4003B00DUL))
#define FM4_RTC_WTMIR                             *((volatile  uint8_t*)(0x4003B00DUL))
#define FM_RTC_WTHR                               *((volatile  uint8_t*)(0x4003B00EUL))
#define FM4_RTC_WTHR                              *((volatile  uint8_t*)(0x4003B00EUL))
#define FM_RTC_WTDR                               *((volatile  uint8_t*)(0x4003B00FUL))
#define FM4_RTC_WTDR                              *((volatile  uint8_t*)(0x4003B00FUL))
#define FM_RTC_WTDW                               *((volatile  uint8_t*)(0x4003B010UL))
#define FM4_RTC_WTDW                              *((volatile  uint8_t*)(0x4003B010UL))
#define FM_RTC_WTMOR                              *((volatile  uint8_t*)(0x4003B011UL))
#define FM4_RTC_WTMOR                             *((volatile  uint8_t*)(0x4003B011UL))
#define FM_RTC_WTYR                               *((volatile  uint8_t*)(0x4003B012UL))
#define FM4_RTC_WTYR                              *((volatile  uint8_t*)(0x4003B012UL))
#define FM_RTC_ALMIR                              *((volatile  uint8_t*)(0x4003B015UL))
#define FM4_RTC_ALMIR                             *((volatile  uint8_t*)(0x4003B015UL))
#define FM_RTC_ALHR                               *((volatile  uint8_t*)(0x4003B016UL))
#define FM4_RTC_ALHR                              *((volatile  uint8_t*)(0x4003B016UL))
#define FM_RTC_ALDR                               *((volatile  uint8_t*)(0x4003B017UL))
#define FM4_RTC_ALDR                              *((volatile  uint8_t*)(0x4003B017UL))
#define FM_RTC_ALMOR                              *((volatile  uint8_t*)(0x4003B019UL))
#define FM4_RTC_ALMOR                             *((volatile  uint8_t*)(0x4003B019UL))
#define FM_RTC_ALYR                               *((volatile  uint8_t*)(0x4003B01AUL))
#define FM4_RTC_ALYR                              *((volatile  uint8_t*)(0x4003B01AUL))
#define FM_RTC_WTTR                               *((volatile uint32_t*)(0x4003B01CUL))
#define FM4_RTC_WTTR                              *((volatile uint32_t*)(0x4003B01CUL))
#define FM_RTC_WTCLKS                             *((volatile  uint8_t*)(0x4003B020UL))
#define FM4_RTC_WTCLKS                            *((volatile  uint8_t*)(0x4003B020UL))
#define FM_RTC_WTCLKM                             *((volatile  uint8_t*)(0x4003B021UL))
#define FM4_RTC_WTCLKM                            *((volatile  uint8_t*)(0x4003B021UL))
#define FM_RTC_WTCAL                              *((volatile uint16_t*)(0x4003B024UL))
#define FM4_RTC_WTCAL                             *((volatile uint16_t*)(0x4003B024UL))
#define FM_RTC_WTCALEN                            *((volatile  uint8_t*)(0x4003B026UL))
#define FM4_RTC_WTCALEN                           *((volatile  uint8_t*)(0x4003B026UL))
#define FM_RTC_WTDIV                              *((volatile  uint8_t*)(0x4003B028UL))
#define FM4_RTC_WTDIV                             *((volatile  uint8_t*)(0x4003B028UL))
#define FM_RTC_WTDIVEN                            *((volatile  uint8_t*)(0x4003B029UL))
#define FM4_RTC_WTDIVEN                           *((volatile  uint8_t*)(0x4003B029UL))
#define FM_RTC_WTCALPRD                           *((volatile  uint8_t*)(0x4003B02CUL))
#define FM4_RTC_WTCALPRD                          *((volatile  uint8_t*)(0x4003B02CUL))
#define FM_RTC_WTCOSEL                            *((volatile  uint8_t*)(0x4003B030UL))
#define FM4_RTC_WTCOSEL                           *((volatile  uint8_t*)(0x4003B030UL))

