MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2GM6HHAGV20000/mcu.h
/******************************************************************************
 ** SMCIF Registers SMCIF0
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_SMCIF0_GLOBALCONTROL1                  *((volatile uint16_t*)(0x4003C900UL))
#define FM4_SMCIF0_GLOBALCONTROL1                 *((volatile uint16_t*)(0x4003C900UL))
#define FM_SMCIF0_STATUS                          *((volatile uint16_t*)(0x4003C904UL))
#define FM4_SMCIF0_STATUS                         *((volatile uint16_t*)(0x4003C904UL))
#define FM_SMCIF0_PORTCONTROL                     *((volatile uint16_t*)(0x4003C908UL))
#define FM4_SMCIF0_PORTCONTROL                    *((volatile uint16_t*)(0x4003C908UL))
#define FM_SMCIF0_DATA                            *((volatile uint16_t*)(0x4003C90CUL))
#define FM4_SMCIF0_DATA                           *((volatile uint16_t*)(0x4003C90CUL))
#define FM_SMCIF0_CARDCLOCK                       *((volatile uint16_t*)(0x4003C910UL))
#define FM4_SMCIF0_CARDCLOCK                      *((volatile uint16_t*)(0x4003C910UL))
#define FM_SMCIF0_BAUDRATE                        *((volatile uint16_t*)(0x4003C914UL))
#define FM4_SMCIF0_BAUDRATE                       *((volatile uint16_t*)(0x4003C914UL))
#define FM_SMCIF0_GUARDTIMER                      *((volatile uint16_t*)(0x4003C918UL))
#define FM4_SMCIF0_GUARDTIMER                     *((volatile uint16_t*)(0x4003C918UL))
#define FM_SMCIF0_IDLETIMER                       *((volatile uint16_t*)(0x4003C91CUL))
#define FM4_SMCIF0_IDLETIMER                      *((volatile uint16_t*)(0x4003C91CUL))
#define FM_SMCIF0_GLOBALCONTROL2                  *((volatile uint16_t*)(0x4003C920UL))
#define FM4_SMCIF0_GLOBALCONTROL2                 *((volatile uint16_t*)(0x4003C920UL))
#define FM_SMCIF0_DATA_FIFO                       *((volatile uint16_t*)(0x4003C924UL))
#define FM4_SMCIF0_DATA_FIFO                      *((volatile uint16_t*)(0x4003C924UL))
#define FM_SMCIF0_FIFO_LEVEL_READ                 *((volatile uint16_t*)(0x4003C928UL))
#define FM4_SMCIF0_FIFO_LEVEL_READ                *((volatile uint16_t*)(0x4003C928UL))
#define FM_SMCIF0_FIFO_LEVEL_WRITE                *((volatile uint16_t*)(0x4003C92CUL))
#define FM4_SMCIF0_FIFO_LEVEL_WRITE               *((volatile uint16_t*)(0x4003C92CUL))
#define FM_SMCIF0_FIFO_MODE                       *((volatile uint16_t*)(0x4003C930UL))
#define FM4_SMCIF0_FIFO_MODE                      *((volatile uint16_t*)(0x4003C930UL))
#define FM_SMCIF0_FIFO_CLEAR_MSB_WRITE            *((volatile uint16_t*)(0x4003C934UL))
#define FM4_SMCIF0_FIFO_CLEAR_MSB_WRITE           *((volatile uint16_t*)(0x4003C934UL))
#define FM_SMCIF0_FIFO_CLEAR_MSB_READ             *((volatile uint16_t*)(0x4003C938UL))
#define FM4_SMCIF0_FIFO_CLEAR_MSB_READ            *((volatile uint16_t*)(0x4003C938UL))
#define FM_SMCIF0_IRQ_STATUS                      *((volatile uint16_t*)(0x4003C940UL))
#define FM4_SMCIF0_IRQ_STATUS                     *((volatile uint16_t*)(0x4003C940UL))

/******************************************************************************
 ** SMCIF Registers SMCIF1
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_SMCIF1_GLOBALCONTROL1                  *((volatile uint16_t*)(0x4003C980UL))
#define FM4_SMCIF1_GLOBALCONTROL1                 *((volatile uint16_t*)(0x4003C980UL))
#define FM_SMCIF1_STATUS                          *((volatile uint16_t*)(0x4003C984UL))
#define FM4_SMCIF1_STATUS                         *((volatile uint16_t*)(0x4003C984UL))
#define FM_SMCIF1_PORTCONTROL                     *((volatile uint16_t*)(0x4003C988UL))
#define FM4_SMCIF1_PORTCONTROL                    *((volatile uint16_t*)(0x4003C988UL))
#define FM_SMCIF1_DATA                            *((volatile uint16_t*)(0x4003C98CUL))
#define FM4_SMCIF1_DATA                           *((volatile uint16_t*)(0x4003C98CUL))
#define FM_SMCIF1_CARDCLOCK                       *((volatile uint16_t*)(0x4003C990UL))
#define FM4_SMCIF1_CARDCLOCK                      *((volatile uint16_t*)(0x4003C990UL))
#define FM_SMCIF1_BAUDRATE                        *((volatile uint16_t*)(0x4003C994UL))
#define FM4_SMCIF1_BAUDRATE                       *((volatile uint16_t*)(0x4003C994UL))
#define FM_SMCIF1_GUARDTIMER                      *((volatile uint16_t*)(0x4003C998UL))
#define FM4_SMCIF1_GUARDTIMER                     *((volatile uint16_t*)(0x4003C998UL))
#define FM_SMCIF1_IDLETIMER                       *((volatile uint16_t*)(0x4003C99CUL))
#define FM4_SMCIF1_IDLETIMER                      *((volatile uint16_t*)(0x4003C99CUL))
#define FM_SMCIF1_GLOBALCONTROL2                  *((volatile uint16_t*)(0x4003C9A0UL))
#define FM4_SMCIF1_GLOBALCONTROL2                 *((volatile uint16_t*)(0x4003C9A0UL))
#define FM_SMCIF1_DATA_FIFO                       *((volatile uint16_t*)(0x4003C9A4UL))
#define FM4_SMCIF1_DATA_FIFO                      *((volatile uint16_t*)(0x4003C9A4UL))
#define FM_SMCIF1_FIFO_LEVEL_READ                 *((volatile uint16_t*)(0x4003C9A8UL))
#define FM4_SMCIF1_FIFO_LEVEL_READ                *((volatile uint16_t*)(0x4003C9A8UL))
#define FM_SMCIF1_FIFO_LEVEL_WRITE                *((volatile uint16_t*)(0x4003C9ACUL))
#define FM4_SMCIF1_FIFO_LEVEL_WRITE               *((volatile uint16_t*)(0x4003C9ACUL))
#define FM_SMCIF1_FIFO_MODE                       *((volatile uint16_t*)(0x4003C9B0UL))
#define FM4_SMCIF1_FIFO_MODE                      *((volatile uint16_t*)(0x4003C9B0UL))
#define FM_SMCIF1_FIFO_CLEAR_MSB_WRITE            *((volatile uint16_t*)(0x4003C9B4UL))
#define FM4_SMCIF1_FIFO_CLEAR_MSB_WRITE           *((volatile uint16_t*)(0x4003C9B4UL))
#define FM_SMCIF1_FIFO_CLEAR_MSB_READ             *((volatile uint16_t*)(0x4003C9B8UL))
#define FM4_SMCIF1_FIFO_CLEAR_MSB_READ            *((volatile uint16_t*)(0x4003C9B8UL))
#define FM_SMCIF1_IRQ_STATUS                      *((volatile uint16_t*)(0x4003C9C0UL))
#define FM4_SMCIF1_IRQ_STATUS                     *((volatile uint16_t*)(0x4003C9C0UL))

