MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2GM6HHAGV20000/mcu.h
#define bFM_SMCIF1_STATUS_TXEMP                   *((volatile  uint16_t*)(0x42793080UL))
#define bFM4_SMCIF1_STATUS_TXEMP                  *((volatile  uint16_t*)(0x42793080UL))
#define bFM_SMCIF1_STATUS_RXFUL                   *((volatile  uint16_t*)(0x42793084UL))
#define bFM4_SMCIF1_STATUS_RXFUL                  *((volatile  uint16_t*)(0x42793084UL))
#define bFM_SMCIF1_STATUS_RXACT                   *((volatile  uint16_t*)(0x42793088UL))
#define bFM4_SMCIF1_STATUS_RXACT                  *((volatile  uint16_t*)(0x42793088UL))
#define bFM_SMCIF1_STATUS_TXACT                   *((volatile  uint16_t*)(0x4279308CUL))
#define bFM4_SMCIF1_STATUS_TXACT                  *((volatile  uint16_t*)(0x4279308CUL))
#define bFM_SMCIF1_STATUS_CARDDETECT              *((volatile  uint16_t*)(0x42793090UL))
#define bFM4_SMCIF1_STATUS_CARDDETECT             *((volatile  uint16_t*)(0x42793090UL))
#define bFM_SMCIF1_STATUS_CARDEVENT               *((volatile  uint16_t*)(0x42793094UL))
#define bFM4_SMCIF1_STATUS_CARDEVENT              *((volatile  uint16_t*)(0x42793094UL))
#define bFM_SMCIF1_STATUS_RECOFL                  *((volatile  uint16_t*)(0x42793098UL))
#define bFM4_SMCIF1_STATUS_RECOFL                 *((volatile  uint16_t*)(0x42793098UL))
#define bFM_SMCIF1_STATUS_IDTRUN                  *((volatile  uint16_t*)(0x4279309CUL))
#define bFM4_SMCIF1_STATUS_IDTRUN                 *((volatile  uint16_t*)(0x4279309CUL))
#define bFM_SMCIF1_STATUS_RDFIFOOVR               *((volatile  uint16_t*)(0x427930A0UL))
#define bFM4_SMCIF1_STATUS_RDFIFOOVR              *((volatile  uint16_t*)(0x427930A0UL))
#define bFM_SMCIF1_STATUS_RDFIFOFUL               *((volatile  uint16_t*)(0x427930A4UL))
#define bFM4_SMCIF1_STATUS_RDFIFOFUL              *((volatile  uint16_t*)(0x427930A4UL))
#define bFM_SMCIF1_STATUS_WRFIFOEMP               *((volatile  uint16_t*)(0x427930A8UL))
#define bFM4_SMCIF1_STATUS_WRFIFOEMP              *((volatile  uint16_t*)(0x427930A8UL))
#define bFM_SMCIF1_STATUS_RXSTARTERR              *((volatile  uint16_t*)(0x427930ACUL))
#define bFM4_SMCIF1_STATUS_RXSTARTERR             *((volatile  uint16_t*)(0x427930ACUL))
#define bFM_SMCIF1_STATUS_TXRESEND                *((volatile  uint16_t*)(0x427930B0UL))
#define bFM4_SMCIF1_STATUS_TXRESEND               *((volatile  uint16_t*)(0x427930B0UL))
#define bFM_SMCIF1_STATUS_RXRESEND                *((volatile  uint16_t*)(0x427930B4UL))
#define bFM4_SMCIF1_STATUS_RXRESEND               *((volatile  uint16_t*)(0x427930B4UL))


/******************************************************************************
 ** SWWDT Registers SWWDT
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_SWWDT_WDOGCONTROL_INTEN               *((volatile  uint32_t*)(0x42240100UL))
#define bFM4_SWWDT_WDOGCONTROL_INTEN              *((volatile  uint32_t*)(0x42240100UL))
#define bFM_SWWDT_WDOGCONTROL_RESEN               *((volatile  uint32_t*)(0x42240104UL))
#define bFM4_SWWDT_WDOGCONTROL_RESEN              *((volatile  uint32_t*)(0x42240104UL))
#define bFM_SWWDT_WDOGCONTROL_SPM                 *((volatile  uint32_t*)(0x42240110UL))
#define bFM4_SWWDT_WDOGCONTROL_SPM                *((volatile  uint32_t*)(0x42240110UL))

#define bFM_SWWDT_WDOGRIS_RIS                     *((volatile  uint32_t*)(0x42240200UL))
#define bFM4_SWWDT_WDOGRIS_RIS                    *((volatile  uint32_t*)(0x42240200UL))

#define bFM_SWWDT_WDOGSPMC_TGR                    *((volatile  uint32_t*)(0x42240300UL))
#define bFM4_SWWDT_WDOGSPMC_TGR                   *((volatile  uint32_t*)(0x42240300UL))


/******************************************************************************
 ** UNIQUE_ID Registers UNIQUE_ID
 ** 
 **   Bitband Section
 ******************************************************************************/

/******************************************************************************
 ** USB Registers USB0
 ** 
 **   Bitband Section
 ******************************************************************************/
#define bFM_USB0_EP0C_STAL                        *((volatile  uint16_t*)(0x428424A4UL))
#define bFM4_USB0_EP0C_STAL                       *((volatile  uint16_t*)(0x428424A4UL))

#define bFM_USB0_EP0IS_DRQI                       *((volatile  uint16_t*)(0x428428A8UL))
#define bFM4_USB0_EP0IS_DRQI                      *((volatile  uint16_t*)(0x428428A8UL))
#define bFM_USB0_EP0IS_DRQIIE                     *((volatile  uint16_t*)(0x428428B8UL))
#define bFM4_USB0_EP0IS_DRQIIE                    *((volatile  uint16_t*)(0x428428B8UL))
#define bFM_USB0_EP0IS_BFINI                      *((volatile  uint16_t*)(0x428428BCUL))
#define bFM4_USB0_EP0IS_BFINI                     *((volatile  uint16_t*)(0x428428BCUL))

#define bFM_USB0_EP0OS_SPK                        *((volatile  uint16_t*)(0x42842924UL))
#define bFM4_USB0_EP0OS_SPK                       *((volatile  uint16_t*)(0x42842924UL))
#define bFM_USB0_EP0OS_DRQO                       *((volatile  uint16_t*)(0x42842928UL))
#define bFM4_USB0_EP0OS_DRQO                      *((volatile  uint16_t*)(0x42842928UL))
#define bFM_USB0_EP0OS_SPKIE                      *((volatile  uint16_t*)(0x42842934UL))
#define bFM4_USB0_EP0OS_SPKIE                     *((volatile  uint16_t*)(0x42842934UL))
#define bFM_USB0_EP0OS_DRQOIE                     *((volatile  uint16_t*)(0x42842938UL))
#define bFM4_USB0_EP0OS_DRQOIE                    *((volatile  uint16_t*)(0x42842938UL))
#define bFM_USB0_EP0OS_BFINI                      *((volatile  uint16_t*)(0x4284293CUL))
#define bFM4_USB0_EP0OS_BFINI                     *((volatile  uint16_t*)(0x4284293CUL))

#define bFM_USB0_EP1C_STAL                        *((volatile  uint16_t*)(0x42842524UL))
#define bFM4_USB0_EP1C_STAL                       *((volatile  uint16_t*)(0x42842524UL))
#define bFM_USB0_EP1C_NULE                        *((volatile  uint16_t*)(0x42842528UL))
#define bFM4_USB0_EP1C_NULE                       *((volatile  uint16_t*)(0x42842528UL))
#define bFM_USB0_EP1C_DMAE                        *((volatile  uint16_t*)(0x4284252CUL))
#define bFM4_USB0_EP1C_DMAE                       *((volatile  uint16_t*)(0x4284252CUL))
#define bFM_USB0_EP1C_DIR                         *((volatile  uint16_t*)(0x42842530UL))
#define bFM4_USB0_EP1C_DIR                        *((volatile  uint16_t*)(0x42842530UL))
#define bFM_USB0_EP1C_EPEN                        *((volatile  uint16_t*)(0x4284253CUL))
#define bFM4_USB0_EP1C_EPEN                       *((volatile  uint16_t*)(0x4284253CUL))

